---
kind: method
id: M:Autodesk.Revit.ApplicationServices.ControlledApplication.GetFailureDefinitionRegistry
source: html/c371a497-7110-9d90-0c04-c8024016fd4c.htm
---
# Autodesk.Revit.ApplicationServices.ControlledApplication.GetFailureDefinitionRegistry Method

Returns the instance of FailureDefinitionRegistry.

## Syntax (C#)
```csharp
public static FailureDefinitionRegistry GetFailureDefinitionRegistry()
```

## Returns
The instance of FailureDefinitionRegistry.